EDTconf/src/InformationRegisters/НастройкаРассылкиОтчетов/НастройкаРассылкиОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаРассылкиОтчетов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекстПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФорматОтправки</name>
    <type>
      <types>EnumRef.ФорматыСохраненияОтчетов</types>
    </type>
  </resources>
  <dimensions>
    <name>ИмяОтчета</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяВарианта</name>
    <type>
      <types>CatalogRef.ВариантыОтчетов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDTconf/src/Catalogs/ИдентификаторыОбъектовМетаданных/ИдентификаторыОбъектовМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИдентификаторыОбъектовМетаданных</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>Документы</name>
    </items>
    <items>
      <name>ЖурналыДокументов</name>
    </items>
    <items>
      <name>ПланыОбмена</name>
    </items>
    <items>
      <name>Подсистемы</name>
    </items>
    <items>
      <name>РегистрыНакопления</name>
    </items>
    <items>
      <name>РегистрыСведений</name>
    </items>
    <items>
      <name>Роли</name>
    </items>
    <items>
      <name>Справочники</name>
    </items>
    <items>
      <name>Отчеты</name>
    </items>
    <items>
      <name>Обработки</name>
    </items>
    <items>
      <name>ПланыВидовХарактеристик</name>
    </items>
    <items>
      <name>ПланыСчетов</name>
    </items>
    <items>
      <name>ПланыВидовРасчета</name>
    </items>
    <items>
      <name>РегистрыБухгалтерии</name>
    </items>
    <items>
      <name>РегистрыРасчета</name>
    </items>
    <items>
      <name>БизнесПроцессы</name>
    </items>
    <items>
      <name>Задачи</name>
    </items>
  </predefined>
  <attributes>
    <name>ПорядокКоллекции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>430</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолныйСиноним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>430</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БезДанных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПустойСсылки</name>
    <type>
      <types>AnyRef</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючОбъектаМетаданных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDTconf/src/InformationRegisters/НастройкаРассылкиОтчетов/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура ИмяВариантаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
		
	ПараметрыФормы = Новый Структура;
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("КлючОбъекта", Общегоназначения.ПолучитьЗначениеРеквизита(Запись.ИмяОтчета,"ПолноеИмя"));

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
 
	ОткрытьФорму("Справочник.ВариантыОтчетов.Форма.ВыборВариантаОтчета", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ИмяОтчетаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
		
	ПараметрыФормы = Новый Структура;
	ФН = Новый НастройкиКомпоновкиДанных;
	Эл = ФН.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Эл.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Родитель");
	Эл.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	Эл.ПравоеЗначение = ПредопределенноеЗначение("Справочник.ИдентификаторыОбъектовМетаданных.Отчеты");
	Эл.Использование = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ПараметрыФормы.Вставить("ФиксированныеНастройки", ФН);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
	ПараметрыФормы.Вставить("ТекущаяСтрока", Запись.ИмяОтчета);
	ПараметрыФормы.Вставить("ЗакрыватьПослеВыбора", Истина);
	ФормаВыбора = ПолучитьФорму("Справочник.ИдентификаторыОбъектовМетаданных.ФормаВыбора", ПараметрыФормы,Элемент);
	
	ФормаВыбора.Элементы.Список.Отображение  = ОтображениеТаблицы.Список;
	
	ФормаВыбора.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Запись.ИмяВарианта = ВыбранноеЗначение.Отчет;
КонецПроцедуры
